# Imputing Missing Values

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [3]:
# CHURN MODELLING DATASET 

df = pd.read_csv('churn_data_st.csv')
df.head()

,customerID,gender,SeniorCitizen,tenure,ServiceCount,Contract,PaperlessBilling,MonthlyCharges,TotalCharges,Churn
0,7590-VHVEG,Female,0,1,2,Month-to-month,Yes,29.85,29.85,No
1,5575-GNVDE,Male,0,34,4,One year,No,56.95,1889.50,No
2,3668-QPYBK,Male,0,2,4,Month-to-month,Yes,53.85,108.15,Yes
3,7795-CFOCW,Male,0,45,4,One year,No,42.30,1840.75,No
4,9237-HQITU,Female,0,2,2,Month-to-month,Yes,70.70,151.65,Yes

In [4]:
churn_df = df.copy()
churn_df.head()

,customerID,gender,SeniorCitizen,tenure,ServiceCount,Contract,PaperlessBilling,MonthlyCharges,TotalCharges,Churn
0,7590-VHVEG,Female,0,1,2,Month-to-month,Yes,29.85,29.85,No
1,5575-GNVDE,Male,0,34,4,One year,No,56.95,1889.50,No
2,3668-QPYBK,Male,0,2,4,Month-to-month,Yes,53.85,108.15,Yes
3,7795-CFOCW,Male,0,45,4,One year,No,42.30,1840.75,No
4,9237-HQITU,Female,0,2,2,Month-to-month,Yes,70.70,151.65,Yes

In [5]:
churn_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7043 entries, 0 to 7042
Data columns (total 10 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   customerID        7043 non-null   object
 1   gender            7043 non-null   object
 2   SeniorCitizen     7043 non-null   int64
 3   tenure            7043 non-null   int64
 4   ServiceCount      7043 non-null   int64
 5   Contract          7043 non-null   object
 6   PaperlessBilling  7043 non-null   object
 7   MonthlyCharges    7043 non-null   float64
 8   TotalCharges      7016 non-null   float64
 9   Churn             7043 non-null   object
dtypes: float64(2), int64(3), object(5)
memory usage: 550.4+ KB

In [6]:
churn_df.isnull().sum()

customerID           0
gender               0
SeniorCitizen        0
tenure               0
ServiceCount         0
Contract             0
PaperlessBilling     0
MonthlyCharges       0
TotalCharges        27
Churn                0
dtype: int64

In [7]:
churn_df.shape

(7043, 10)

In [8]:
churn_df.columns.tolist()

['customerID',
 'gender',
 'SeniorCitizen',
 'tenure',
 'ServiceCount',
 'Contract',
 'PaperlessBilling',
 'MonthlyCharges',
 'TotalCharges',
 'Churn']

In [9]:
# CHECKING THE DATA WHICH IS HAVING THE NULL VALUES

churn_df[churn_df['TotalCharges'].isnull()]

,customerID,gender,SeniorCitizen,tenure,ServiceCount,Contract,PaperlessBilling,MonthlyCharges,TotalCharges,Churn
431,7781-HVGMK,Female,0,72,7,Two year,Yes,65.20,NaN,No
488,4472-LVYGI,Female,0,0,5,Two year,Yes,52.55,NaN,No
753,3115-CZMZD,Male,0,0,7,Two year,No,20.25,NaN,No
936,5709-LVOEQ,Female,0,0,7,Two year,No,80.85,NaN,No
1082,4367-NUYAO,Male,0,0,8,Two year,No,25.75,NaN,No
1261,4741-WWJQZ,Female,0,2,4,Month-to-month,Yes,80.15,NaN,No
1287,8800-ZKRFW,Female,0,30,8,Month-to-month,Yes,107.50,NaN,No
1340,1371-DWPAZ,Female,0,0,6,Two year,No,56.05,NaN,No
1487,5035-PGZXH,Female,0,56,7,One year,Yes,106.80,NaN,No
1846,7369-TRPFD,Male,0,19,7,One year,No,18.80,NaN,No
1908,8232-UTFOZ,Male,0,69,7,Two year,No,19.95,NaN,No
2073,3061-BCKYI,Male,0,14,7,Month-to-month,No,19.90,NaN,No
2151,2560-WBWXF,Male,0,68,8,Two year,Yes,24.15,NaN,No
2243,1013-QCWAM,Female,1,66,6,Month-to-month,Yes,100.80,NaN,No
2321,9776-OJUZI,Female,1,65,6,Month-to-month,Yes,95.45,NaN,No
2441,9050-IKDZA,Female,1,2,3,Month-to-month,No,81.50,NaN,No
2477,1212-GLHMD,Male,0,3,4,Month-to-month,Yes,86.05,NaN,No
3331,7644-OMVMY,Male,0,0,7,Two year,No,19.85,NaN,No
3826,3213-VVOLG,Male,0,0,8,Two year,No,25.35,NaN,No
3865,5701-SVCWR,Female,0,1,8,Month-to-month,No,24.00,NaN,No
4380,2520-SGTTA,Female,0,0,7,Two year,No,20.00,NaN,No
5218,2923-ARZLG,Male,0,0,7,One year,Yes,19.70,NaN,No
5742,5135-GRQJV,Male,1,72,9,Two year,Yes,114.50,NaN,No
5830,6754-WKSHP,Male,0,30,8,One year,No,25.35,NaN,No
6670,4075-WKNIU,Female,0,0,7,Two year,No,73.35,NaN,No
6754,2775-SEFEE,Male,0,0,6,Two year,Yes,61.90,NaN,No
6985,6967-PEJLL,Male,0,37,4,One year,Yes,40.20,NaN,No

In [10]:
len(churn_df[churn_df.isna().any(axis=1)])

27

In [11]:
churn_df[churn_df['tenure']==0][['TotalCharges', 'tenure', 'Churn']]

      TotalCharges  tenure Churn
488            NaN       0    No
753            NaN       0    No
936            NaN       0    No
1082           NaN       0    No
1340           NaN       0    No
3331           NaN       0    No
3826           NaN       0    No
4380           NaN       0    No
5218           NaN       0    No
6670           NaN       0    No
6754           NaN       0    No

In [12]:
churn_df['TotalCharges'].describe()

count    7016.000000
mean     2282.589168
std      2265.506114
min        18.800000
25%       401.925000
50%      1397.100000
75%      3792.325000
max      8684.800000
Name: TotalCharges, dtype: float64

In [13]:
churn_df[churn_df['Churn']=='No'].describe()

       SeniorCitizen       tenure  ServiceCount  MonthlyCharges  TotalCharges
count    5174.000000  5174.000000   5174.000000     5174.000000   5147.000000
mean        0.128721    37.569965      5.811751       61.265124   2555.220264
std         0.334923    24.113777      1.890418       31.092648   2328.034938
min         0.000000     0.000000      1.000000       18.250000     18.800000
25%         0.000000    15.000000      4.000000       25.100000    579.200000
50%         0.000000    38.000000      6.000000       64.425000   1685.900000
75%         0.000000    61.000000      7.000000       88.400000   4263.725000
max         1.000000    72.000000      9.000000      118.750000   8672.450000